feaser/canflasherblt/source/board/olimexino_stm32f3/bxcan.cpp
///**************************************************************************************
/// \file         bxcan.cpp
/// \brief        Basic Extended CAN driver source file.
/// \internal
///--------------------------------------------------------------------------------------
///                          C O P Y R I G H T
///--------------------------------------------------------------------------------------
///   Copyright (c) 2023 by Feaser     www.feaser.com     All rights reserved
///
///--------------------------------------------------------------------------------------
///                            L I C E N S E
///--------------------------------------------------------------------------------------
///
/// SPDX-License-Identifier: MIT
///
/// Permission is hereby granted, free of charge, to any person obtaining a copy
/// of this software and associated documentation files (the "Software"), to deal
/// in the Software without restriction, including without limitation the rights
/// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
/// copies of the Software, and to permit persons to whom the Software is
/// furnished to do so, subject to the following conditions:
///
/// The above copyright notice and this permission notice shall be included in all
/// copies or substantial portions of the Software.
///
/// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
/// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
/// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
/// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
/// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
/// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
/// SOFTWARE.
///
/// \endinternal
///**************************************************************************************

//***************************************************************************************
// Include files
//***************************************************************************************
#include "bxcan.hpp"
#include "stm32f3xx.h"
#include "stm32f3xx_ll_rcc.h"
#include "stm32f3xx_ll_gpio.h"


//***************************************************************************************
// Static data declarations
//***************************************************************************************
/// \brief   Storage for the single bxCan instance. 
/// \details Needed for mapping the CAN interrupt service routines to the processXxx()
///          instance methods. Note that this only works if there will only be one
///          bxCan instance. This is the case for this board, since its microcontroller
///          only has one CAN controller. 
BxCan* BxCan::s_InstancePtr = nullptr;


///**************************************************************************************
/// \brief     Basic Extended CAN driver constructor. 
///
///**************************************************************************************
BxCan::BxCan()
  : Can(),
    cpp_freertos::Thread("CanThread", configMINIMAL_STACK_SIZE, 8)
{
  LL_GPIO_InitTypeDef GPIO_InitStruct{ };

  // Verify that only one instance of BxCan is created.
  TBX_ASSERT(s_InstancePtr == nullptr);
  // Store a pointer to ourselves.
  s_InstancePtr = this;

  // CAN TX and RX GPIO pin configuration.
  GPIO_InitStruct.Pin = LL_GPIO_PIN_8 | LL_GPIO_PIN_9;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
  GPIO_InitStruct.Alternate = LL_GPIO_AF_9;
  LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  // Enable the CAN related interrupts in the NVIC.
  NVIC_EnableIRQ(CAN_TX_IRQn);
  NVIC_EnableIRQ(CAN_RX0_IRQn);
  NVIC_EnableIRQ(CAN_RX1_IRQn);
  NVIC_EnableIRQ(CAN_SCE_IRQn);  

  // Start the thread.
  Start();
}


///**************************************************************************************
/// \brief     Basic Extended CAN driver destructor.
///
///**************************************************************************************
BxCan::~BxCan()
{
  // Disable the CAN related interrupts in the NVIC.
  NVIC_DisableIRQ(CAN_TX_IRQn);
  NVIC_DisableIRQ(CAN_RX0_IRQn);
  NVIC_DisableIRQ(CAN_RX1_IRQn);
  NVIC_DisableIRQ(CAN_SCE_IRQn);  

  // Reset the instance pointer.
  s_InstancePtr = nullptr;
}


///**************************************************************************************
/// \brief     Sets the message reception acceptance filter. Automatically reconnects,
///            if the driver is in the connected state when calling this method.
/// \param     t_Filter Message reception acceptance filter.
///
///**************************************************************************************
void BxCan::setFilter(CanFilter& t_Filter)
{
  // Store current connection state.
  uint8_t wasConnected = m_Connected;

  // Make sure that we're in the disconnected state, before updating the filter.
  disconnect();
  // Copy and store the filter settings.
  m_Filter = t_Filter;
  // Reconnect if needed.
  if (wasConnected == TBX_TRUE)
  {
    connect(m_Baudrate);
  }
}


///**************************************************************************************
/// \brief     Configures the CAN controller and synchronizes to the CAN bus.
/// \param     t_Baudrate Desired communication speed.
///
///**************************************************************************************
void BxCan::connect(Baudrate t_Baudrate)
{
  constexpr uint32_t maxLoopCntInitAck = 10000000UL;
  volatile  uint32_t initAckLoopCnt;
  uint16_t           prescaler = 8U;
  uint8_t            tseg1 = 6U;
  uint8_t            tseg2 = 2U;
  uint8_t            sjw;
  uint8_t            bitTimingSettingsFound;

  // Make sure that we're in the disconnected state, before connecting.
  disconnect();
  // Store the baudrate.
  m_Baudrate = t_Baudrate;

  // Enter initialization mode.
  CLEAR_BIT(CAN->MCR, CAN_MCR_SLEEP);
  SET_BIT(CAN->MCR, CAN_MCR_INRQ);
  // Wait for hardware handshake with timeout to not hang the system, in case the CAN
  // controller is malfunctioning. No need to take further action, because in such a
  // case, the CAN controller won't work properly anyways.
  initAckLoopCnt = maxLoopCntInitAck;
  while ((READ_BIT(CAN->MSR, CAN_MSR_INAK) == 0U) && (initAckLoopCnt > 0U))
  {
    initAckLoopCnt--;
  }

  // Attempt to find fitting bit timing settings.
  bitTimingSettingsFound = findBitTimingSettings(prescaler, tseg1, tseg2);
  // Trigger assertion in case no valid bit timing settings could be found. This would
  // indicate a configuration issue that can be fixed by changing the CAN baudrate or
  // the frequency of the clock that drives the CAN peripheral.
  TBX_ASSERT(bitTimingSettingsFound == TBX_OK);
  // Configure the bit timing settings.
  CLEAR_BIT(CAN->BTR, CAN_BTR_BRP | CAN_BTR_TS1 | CAN_BTR_TS2 | CAN_BTR_SJW);
  SET_BIT(CAN->BTR, (prescaler - 1U) << CAN_BTR_BRP_Pos);
  SET_BIT(CAN->BTR, (tseg1 - 1U) << CAN_BTR_TS1_Pos);
  SET_BIT(CAN->BTR, (tseg2 - 1U) << CAN_BTR_TS2_Pos);
  // Set SJW as big as possible (4), but no more than tseg2.
  sjw = (tseg2 > 4U) ? 4U : tseg2;
  SET_BIT(CAN->BTR, (sjw - 1U) << CAN_BTR_SJW_Pos);

  // Configure transmit priority by request order. Essentially making the 3 transmit
  // mailboxes behave as a FIFO.
  SET_BIT(CAN->MCR, CAN_MCR_TXFP);
  // Support automatic retransmission in case of arbitration lost.
  CLEAR_BIT(CAN->MCR, CAN_MCR_NART);
  // Make sure time triggered communication mode is disabled.
  CLEAR_BIT(CAN->MCR, CAN_MCR_TTCM);
  // Disable automatic bus off recovery.
  CLEAR_BIT(CAN->MCR, CAN_MCR_ABOM);
  // Discard incoming message in case of reception FIFO overrun.
  SET_BIT(CAN->MCR, CAN_MCR_RFLM);
  // Make sure the transmit request complete bits are reset, by writing a 1 to them. Note
  // that this is a special register. You need to directly write the RQCP bit values.
  WRITE_REG(CAN->TSR, CAN_TSR_RQCP0 | CAN_TSR_RQCP1 | CAN_TSR_RQCP2);

  // Enter reception filter initialization mode.
  SET_BIT(CAN->FMR, CAN_FMR_FINIT);
  // For receiving just 11-bit identifiers, use only FIFO0 with filter 0.
  if (m_Filter.mode == CanFilter::STD)
  {
    // Select identifier mask mode for filter 0.
    CLEAR_BIT(CAN->FM1R, CAN_FM1R_FBM0);
    // Select single 32-bit scaling for filter 0.
    SET_BIT(CAN->FS1R, CAN_FS1R_FSC0);
    // Set the filter's code and mask bits for 11-bit standard identifiers.
    WRITE_REG(CAN->sFilterRegister[0].FR1, m_Filter.code << 21U);
    WRITE_REG(CAN->sFilterRegister[0].FR2, m_Filter.mask << 21U);
    SET_BIT(CAN->sFilterRegister[0].FR2, CAN_F0R2_FB2); // IDE bit
    // Assign filter 0 to FIFO0.
    CLEAR_BIT(CAN->FFA1R, CAN_FFA1R_FFA0);
    // Activate filter 0.
    SET_BIT(CAN->FA1R, CAN_FA1R_FACT0);
  }
  // For receiving just 29-bit identifiers, use only FIFO0 with filter 0.
  else if (m_Filter.mode == CanFilter::EXT)
  {
    // Select identifier mask mode for filter 0.
    CLEAR_BIT(CAN->FM1R, CAN_FM1R_FBM0);
    // Select single 32-bit scaling for filter 0.
    SET_BIT(CAN->FS1R, CAN_FS1R_FSC0);
    // Set the filter's code and mask bits for 29-bit extended identifiers.
    WRITE_REG(CAN->sFilterRegister[0].FR1, m_Filter.code << 3U);
    SET_BIT(CAN->sFilterRegister[0].FR1, CAN_F0R1_FB2); // IDE bit
    WRITE_REG(CAN->sFilterRegister[0].FR2, m_Filter.mask << 3U);
    SET_BIT(CAN->sFilterRegister[0].FR2, CAN_F0R2_FB2); // IDE bit
    // Assign filter 0 to FIFO0.
    CLEAR_BIT(CAN->FFA1R, CAN_FFA1R_FFA0);
    // Activate filter 0.
    SET_BIT(CAN->FA1R, CAN_FA1R_FACT0);
  }
  // For receiving both 11-bit and 29-bit identifers, use FIFO0 with filter 0 for the
  // 11-bit CAN identifiers and FIFO1 with filter 1 for the 29-bit CAN identifiers.
  else
  {
    // Select identifier mask mode for filter 0.
    CLEAR_BIT(CAN->FM1R, CAN_FM1R_FBM0);
    // Select single 32-bit scaling for filter 0.
    SET_BIT(CAN->FS1R, CAN_FS1R_FSC0);
    // Set the filter's code and mask bits for 11-bit standard identifiers.
    WRITE_REG(CAN->sFilterRegister[0].FR1, m_Filter.code << 21U);
    WRITE_REG(CAN->sFilterRegister[0].FR2, m_Filter.mask << 21U);
    SET_BIT(CAN->sFilterRegister[0].FR2, CAN_F0R2_FB2); // IDE bit
    // Assign filter 0 to FIFO0.
    CLEAR_BIT(CAN->FFA1R, CAN_FFA1R_FFA0);
    // Activate filter 0.
    SET_BIT(CAN->FA1R, CAN_FA1R_FACT0);

