feaser/canflasherblt/source/board/olimexino_stm32f3/bxcan.cpp
    // Select identifier mask mode for filter 1.
    CLEAR_BIT(CAN->FM1R, CAN_FM1R_FBM1);
    // Select single 32-bit scaling for filter 1.
    SET_BIT(CAN->FS1R, CAN_FS1R_FSC1);
    // Set the filter's code and mask bits for 29-bit extended identifiers.
    WRITE_REG(CAN->sFilterRegister[1].FR1, m_Filter.code << 3U);
    SET_BIT(CAN->sFilterRegister[1].FR1, CAN_F1R1_FB2); // IDE bit
    WRITE_REG(CAN->sFilterRegister[1].FR2, m_Filter.mask << 3U);
    SET_BIT(CAN->sFilterRegister[1].FR2, CAN_F1R2_FB2); // IDE bit
    // Assign filter 1 to FIFO1.
    SET_BIT(CAN->FFA1R, CAN_FFA1R_FFA1);
    // Activate filter 1.
    SET_BIT(CAN->FA1R, CAN_FA1R_FACT1);
  }
  // Leave reception filter initialization mode.
  CLEAR_BIT(CAN->FMR, CAN_FMR_FINIT);

  // Enable transmit mailbox empty interrupt.
  SET_BIT(CAN->IER, CAN_IER_TMEIE);
  // Enable FIFO message pending interrupt for both FIFOs.
  SET_BIT(CAN->IER, CAN_IER_FMPIE0 | CAN_IER_FMPIE1);
  // Enable bus off error interrupt.
  SET_BIT(CAN->IER, CAN_IER_ERRIE | CAN_IER_BOFIE);

  // Leave initialization mode.
  CLEAR_BIT(CAN->MCR, CAN_MCR_INRQ);
  // Wait for hardware handshake with timeout to not hang the system, in case the CAN
  // controller is malfunctioning. No need to take further action, because in such a
  // case, the CAN controller won't work properly anyways.
  initAckLoopCnt = maxLoopCntInitAck;
  while ((READ_BIT(CAN->MSR, CAN_MSR_INAK) != 0U) && (initAckLoopCnt > 0U))
  {
    initAckLoopCnt--;
  }

  // Update connection state flag.
  m_Connected = TBX_TRUE;
}


///**************************************************************************************
/// \brief     Disconnects from the CAN bus.
///
///**************************************************************************************
void BxCan::disconnect()
{
  // Only continue if actually connected.
  if (m_Connected == TBX_TRUE)
  {
    // Update connection state flag.
    m_Connected = TBX_FALSE;

    // TODO ##Vg Implement disconnect().

  }
}


///**************************************************************************************
/// \brief     Submits a message for transmission on the CAN bus.
/// \param     t_Msg The message to transmit.
/// \return    TBX_OK if successful, TBX_ERROR otherwise.
///
///**************************************************************************************
uint8_t BxCan::transmit(CanMsg& t_Msg)
{
  uint8_t result = TBX_ERROR;
  uint8_t txMbEmptyIdx;
  // Lookup table indexed with the TSR->TMEx bits value. In return it gives the index
  // of the first empty transmit mailbox. Made static to lower ROM and stack load.
  static const uint8_t txMbIdxEmptyLookup[] =
  {
    c_InvalidMailboxIdx, // %000 - All mailboxes are busy.
    0U,                  // %001 - Mailbox 1 is available.
    1U,                  // %010 - Mailbox 2 is available.
    0U,                  // %011 - Mailbox 1 is available.
    2U,                  // %100 - Mailbox 3 is available.
    0U,                  // %101 - Mailbox 1 is available.
    1U,                  // %110 - Mailbox 2 is available.
    0U                   // %111 - Mailbox 1 is available.
  };

  // Only continue if actually connected.
  if (m_Connected == TBX_TRUE)
  {
    // Obtain mutual exclusive access to the transmit mailboxes.
    TbxCriticalSectionEnter();
    // Get first free transmit mailbox index by feeding the value of the TMEx bits into
    // the lookup table.
    uint8_t tmeBits = READ_BIT(CAN->TSR, CAN_TSR_TME) >> CAN_TSR_TME_Pos;
    txMbEmptyIdx = txMbIdxEmptyLookup[tmeBits];
    // Only continue with transmission if an empty mailbox is available.
    if (txMbEmptyIdx != c_InvalidMailboxIdx)
    {
      // Write the identifier to the mailbox.
      if (t_Msg.ext() == TBX_TRUE)
      {
        // Write 29-bit identifier and set the IDE bit.
        WRITE_REG(CAN->sTxMailBox[txMbEmptyIdx].TIR, t_Msg.id() << 3U);
        SET_BIT(CAN->sTxMailBox[txMbEmptyIdx].TIR, CAN_TI0R_IDE); // IDE bit
      }
      else
      {
        // Write 11-bit identifier in a way that also resets the IDE bit.
        WRITE_REG(CAN->sTxMailBox[txMbEmptyIdx].TIR, t_Msg.id() << 21U);
      }
      // Write the data length code (DLC).
      CLEAR_BIT(CAN->sTxMailBox[txMbEmptyIdx].TDTR, CAN_TDT0R_DLC);
      SET_BIT(CAN->sTxMailBox[txMbEmptyIdx].TDTR, t_Msg.len() << CAN_TDT0R_DLC_Pos);
      // Write the data bytes.
      uint32_t dataLow  =  t_Msg[0]         | (t_Msg[1] << 8U) | 
                          (t_Msg[2] << 16U) | (t_Msg[3] << 24U);
      uint32_t dataHigh =  t_Msg[4]         | (t_Msg[5] << 8U) | 
                          (t_Msg[7] << 16U) | (t_Msg[7] << 24U);
      WRITE_REG(CAN->sTxMailBox[txMbEmptyIdx].TDLR, dataLow);
      WRITE_REG(CAN->sTxMailBox[txMbEmptyIdx].TDHR, dataHigh);
      // Request start of message for transmission.
      SET_BIT(CAN->sTxMailBox[txMbEmptyIdx].TIR, CAN_TI0R_TXRQ);
      // Update the result.
      result = TBX_OK;
    }
    // Release mutual exclusive access to the transmit mailboxes.
    TbxCriticalSectionExit();
  }
  // Give the result back to the caller.
  return result;
}


///**************************************************************************************
/// \brief     CAN communication event task function.
///
///**************************************************************************************
void BxCan::Run()
{
  for (;;)
  {
    // TODO ##Vg Implement event loop.
    Delay(50U);
  }
}


///**************************************************************************************
/// \brief     CAN communication interrupt service routine.
///
///**************************************************************************************
void BxCan::processInterrupt()
{
  // ------------------------------------------------------------------------------------
  // ---------------------------- Transmit interrupt ------------------------------------
  // ------------------------------------------------------------------------------------
  // Process the transmit complete interrupt events.
  while (READ_BIT(CAN->TSR, CAN_TSR_RQCP0 | CAN_TSR_RQCP1 | CAN_TSR_RQCP2) != 0)
  {
    uint8_t  txMbDoneIdx = c_InvalidMailboxIdx;
    uint32_t txMbDoneRQCPbit;

    // Decide which transmit mailbox, with a completed request, to process. Store its
    // RQCP bit value and transmit mailbox index. An invalid transmit mailbox index value
    // is used to signal that the transmission was not successful.
    if (READ_BIT(CAN->TSR, CAN_TSR_RQCP0) != 0)
    {
      txMbDoneRQCPbit = CAN_TSR_RQCP0;
      if (READ_BIT(CAN->TSR, CAN_TSR_TXOK0) != 0)
      {
        txMbDoneIdx = 0U;
      }
    }
    else if (READ_BIT(CAN->TSR, CAN_TSR_RQCP1) != 0)
    {
      txMbDoneRQCPbit = CAN_TSR_RQCP1;
      if (READ_BIT(CAN->TSR, CAN_TSR_TXOK1) != 0)
      {
        txMbDoneIdx = 1U;
      }
    }
    else
    {
      txMbDoneRQCPbit = CAN_TSR_RQCP2;
      if (READ_BIT(CAN->TSR, CAN_TSR_TXOK2) != 0)
      {
        txMbDoneIdx = 2U;
      }
    }

    // Only need to retrieve the message info in case of a successful tranmsission.
    if (txMbDoneIdx != c_InvalidMailboxIdx)
    {
      // TODO ##Vg Add transmit complete event to the queue.
    }

    // Reset the mailbox' RQCP bit flag to be able to detect the next request completed
    // event. Note that this also clears the mailbox' TXOK, ALST and TERR bits. Note that
    // you need to write a 1 to the RQCP bit to clear it. A bitwise OR operation does
    // not work properly on this register. It would actually result in all RQCP bit flags
    // clearing.
    WRITE_REG(CAN->TSR, txMbDoneRQCPbit);
  }
}


