feaser/canflasherblt/source/board/olimexino_stm32f3/bxcan.cpp
///**************************************************************************************
/// \brief     Helper function to find appropriate bit timing settings to the requested
///            baudrate configuration and taking into account the clock frequency that
///            drives the CAN controller.
/// \param     t_Prescaler Prescaler value for the baudrate generator [1..1024].
/// \param     t_Tseg1 Time segment 1 bit value [1..16].
/// \param     t_Tseg2 Time segment 2 bit value [1..8].
/// \return    TBX_OK if fitting bit timing settings could be found, TBX_ERROR otherwise.
///
///**************************************************************************************
uint8_t BxCan::findBitTimingSettings(uint16_t& t_Prescaler, uint8_t& t_Tseg1,
                                  uint8_t& t_Tseg2)
{
  uint8_t result = TBX_ERROR;
  // Bit time in time quanta (TQ) = 1 (for SYNC) + tseg1 + tseg2. Given the possible
  // range for tseg1 and tseg2 this means:
  // - bitTimeMaxTQ = 1 + 16 + 8 = 25 TQ
  // - bitTimeMinTQ = 1 + 1 + 1 = 3 TQ
  // Just keep in mind the tseg ranges that the hardware supports:
  // - tseg1 = 1..16
  // - tseg2 = 1..8
  //
  // The following table lists the different configuration options for each supported
  // total number of TQ in a bit, such that tseg1 and tseg2 result in a sample point
  // (SP) that is as close to 75% as possible, as this is the preferred sample point for
  // protocols such as CANopen and DeviceNet. Made static to lower ROM and stack load.
  static const struct
  {
    uint8_t tq;
    uint8_t tseg1;
    uint8_t tseg2;
  } bitTimingTbl[] =
  {
    { 23U, 16U,  6U },  // SP = 100 - (6 / 23) * 100 = 74%
    { 22U, 16U,  5U },  // SP = 100 - (5 / 22) * 100 = 77%
    { 21U, 15U,  5U },  // SP = 100 - (5 / 21) * 100 = 76%
    { 20U, 14U,  5U },  // SP = 100 - (5 / 20) * 100 = 75%
    { 19U, 13U,  5U },  // SP = 100 - (5 / 19) * 100 = 74%
    { 18U, 13U,  4U },  // SP = 100 - (4 / 18) * 100 = 78%
    { 17U, 12U,  4U },  // SP = 100 - (4 / 17) * 100 = 76%
    { 16U, 11U,  4U },  // SP = 100 - (4 / 16) * 100 = 75%
    { 15U, 10U,  4U },  // SP = 100 - (4 / 15) * 100 = 72%
    { 14U, 10U,  3U },  // SP = 100 - (3 / 14) * 100 = 79%
    { 13U,  9U,  3U },  // SP = 100 - (3 / 13) * 100 = 77%
    { 12U,  8U,  3U },  // SP = 100 - (3 / 12) * 100 = 75%
    { 11U,  7U,  3U },  // SP = 100 - (3 / 11) * 100 = 73%
    { 10U,  7U,  2U },  // SP = 100 - (2 / 10) * 100 = 80%
    {  9U,  6U,  2U },  // SP = 100 - (2 /  9) * 100 = 78%
    {  8U,  5U,  2U },  // SP = 100 - (2 /  8) * 100 = 75%
    {  7U,  4U,  2U },  // SP = 100 - (2 /  7) * 100 = 71%
    {  6U,  4U,  1U },  // SP = 100 - (1 /  6) * 100 = 83%
    {  5U,  3U,  1U },  // SP = 100 - (1 /  5) * 100 = 80%
    {  4U,  3U,  1U },  // SP = 100 - (1 /  4) * 100 = 75%
    {  3U,  2U,  1U }   // SP = 100 - (1 /  3) * 100 = 67%
  };
  constexpr size_t     bitTimeTblSize = sizeof(bitTimingTbl)/sizeof(bitTimingTbl[0]);
  constexpr uint16_t   maxPrescaler = 1024U;
  constexpr uint16_t   minPrescaler = 1U;
  const uint32_t       baudrate = static_cast<uint32_t>(m_Baudrate);
  size_t               tblIdx;
  uint16_t             prescaler;
  LL_RCC_ClocksTypeDef rccClocks{ };

  // Determine the speed of the clock that drives the CAN peripheral.
  LL_RCC_GetSystemClocksFreq(&rccClocks);
  TBX_ASSERT(rccClocks.PCLK1_Frequency != 0);
  uint32_t canClockFreqHz = rccClocks.PCLK1_Frequency;

  // Search for a fitting prescaler by looping through all its possible values.
  for (prescaler = minPrescaler; prescaler <= maxPrescaler; prescaler++)
  {
    // Determine if this prescaler, combined with a TQ per bit results in an exact match
    // for the requested baudrate, while taking into account that a larger amount of TQ
    // per bit, allows for a better sample point configuration.
    for (tblIdx = 0U; tblIdx < bitTimeTblSize; tblIdx++)
    {
      // Exact baudrate match using this prescaler and TQ per bit configuration?
      if ((canClockFreqHz / prescaler / bitTimingTbl[tblIdx].tq) == baudrate)
      {
        // Found a match. Store the bit timing settings, update the result and break
        // this loop, since we are done.
        t_Prescaler = prescaler;
        t_Tseg1 = bitTimingTbl[tblIdx].tseg1;
        t_Tseg2 = bitTimingTbl[tblIdx].tseg2;
        result = TBX_OK;
        break;
      }
    }
    // Stop looping if a match was already found.
    if (result == TBX_OK)
    {
      break;
    }
  }
  // Give the result back to the caller.
  return result;
}


extern "C"
{
///**************************************************************************************
/// \brief     Interrupt service routine of the CAN transmitter.
///
///**************************************************************************************
void USB_HP_CAN_TX_IRQHandler(void)
{
  // Only continue if an instance of BxCan was actually created.
  if (BxCan::s_InstancePtr != nullptr)
  {
    // Pass the event on for further handling in the generic interrupt handler.
    BxCan::s_InstancePtr->processInterrupt();
  }
}


///**************************************************************************************
/// \brief     Interrupt service routine of the CAN reception FIFO0.
///
///**************************************************************************************
void USB_LP_CAN_RX0_IRQHandler(void)
{
  // Only continue if an instance of BxCan was actually created.
  if (BxCan::s_InstancePtr != nullptr)
  {
    // Pass the event on for further handling in the generic interrupt handler.
    BxCan::s_InstancePtr->processInterrupt();
  }
}


///**************************************************************************************
/// \brief     Interrupt service routine of the CAN reception FIFO1.
///
///**************************************************************************************
void CAN_RX1_IRQHandler(void)
{
  // Only continue if an instance of BxCan was actually created.
  if (BxCan::s_InstancePtr != nullptr)
  {
    // Pass the event on for further handling in the generic interrupt handler.
    BxCan::s_InstancePtr->processInterrupt();
  }
}


///**************************************************************************************
/// \brief     Interrupt service routine of the CAN error and status monitor.
///
///**************************************************************************************
void CAN_SCE_IRQHandler(void)
{
  // Only continue if an instance of BxCan was actually created.
  if (BxCan::s_InstancePtr != nullptr)
  {
    // Pass the event on for further handling in the generic interrupt handler.
    BxCan::s_InstancePtr->processInterrupt();
  }
}
} // extern "C"


//********************************** end of bxcan.cpp ***********************************
